Erlang/OTP 27 [erts-15.0] [source] [64-bit] [smp:8:8] [ds:8:8:10] [async-threads:1] [jit:ns]

Eshell V15.0 (press Ctrl+G to abort, type help(). for help)
1> 1+1.
2
2> 1.1.
1.1
3> 2#10101
   .
21
4> 16#101.
257
5> $a.
97
6> $b.
98
7> a.
a
8> apple.
apple
9> math:sqrt(2).
1.4142135623730951
10> math:pow(2,2).
4.0
11> is_integer(2).
true
12> is_integer(2.0).
false
13> is_float(2.0).
true
14> 1==1.0.
true
15> 1=:=1.0.
false
16> true.
true
17> false.
false
18> c(third).
third.erl:5:1: Warning: function zero/1 is unused
%    5| zero(0)->0.
%     | ^

{ok,third}
19> c(third).
third.erl:2:9: bad Name/Arity
%    2| -export(zero/1).
%     |         ^

third.erl:5:1: Warning: function zero/1 is unused
%    5| zero(0)->0.
%     | ^

error
20> c(third).
{ok,third}
21> zero(0).
** exception error: undefined shell command zero/1
22> zero(1).
** exception error: undefined shell command zero/1
23> c(third).
{ok,third}
24> c(third).
third.erl:6:1: function zero/1 already defined
%    6| zero(_)->not_zero.
%     | ^

error
25> c(third).
third.erl:6:1: function zero/1 already defined
%    6| zero(0)->0.
%     | ^

error
26> pwd().
/home/youssef/DDS
ok
27> third:zero(0).
0
28> third:zero(23).
** exception error: no function clause matching 
                    third:zero(23) (third.erl, line 5)
29> c(third).
third.erl:6:1: function zero/1 already defined
%    6| zero(0)->0.
%     | ^

error
30> c(third).
{ok,third}
31> third:zero(23).
** exception error: no function clause matching 
                    third:zero(23) (third.erl, line 5)
32> third:zero(23. 
[1]+  Stopped                 erl
youssef@joe:~/DDS$ erl
Erlang/OTP 27 [erts-15.0] [source] [64-bit] [smp:8:8] [ds:8:8:10] [async-threads:1] [jit:ns]

Eshell V15.0 (press Ctrl+G to abort, type help(). for help)
1> c(third).
{ok,third}
2> third:zero(atom).
not_zero
3> c(third).
third.erl:10:8: syntax error before: A
%   10| inc(A) A+1.
%     |        ^

third.erl:2:2: function zero/1 undefined
%    2| -export([zero/1]).
%     |  ^

error
4> c(third).
third.erl:10:8: syntax error before: A
%   10| inc(A) A+1.
%     |        ^

third.erl:2:2: function inc/1 undefined
%    2| -export([zero/1, inc/1]).
%     |  ^

third.erl:2:2: function zero/1 undefined
%    2| -export([zero/1, inc/1]).
%     |  ^

error
5> c(third).
third.erl:10:8: syntax error before: A
%   10| inc(A) A+1.
%     |        ^

third.erl:2:2: function inc/1 undefined
%    2| -export([zero/1, inc/1]).
%     |  ^

error
6> pwd().
/home/youssef/DDS
ok
7> c(third).
third.erl:10:8: syntax error before: A
%   10| inc(A) A+1.
%     |        ^

third.erl:2:2: function inc/1 undefined
%    2| -export([zero/1, inc/1]).
%     |  ^

error
8> c(third).
{ok,third}
9> third:inc(0).
zero
10> third:inc(0.0).
1.0
11> c(third).
{ok,third}
12> third:inc(0.0).
zero
13> third:inc(5).
6
14> c(third).
third.erl:14:1: Warning: function 'inc atom'/1 is unused
%   14| 'inc atom' (zero) -> one;
%     | ^

{ok,third}
15> c(third).
{ok,third}
16> third:'inc atom'(zero).
one
17> third:'inc atom'(one).
type_atom
18> {}. 
{}
19> {pos, 2, 3}.
{pos,2,3}
20> {pos, {x, 2}, {y, 3}.
* 1:21: syntax error before: '.'
20> {pos, {x, 2}, {y, 3}}.
{pos,{x,2},{y,3}}
21> Point = {pos, {x, 2}, {y, 3}}.
{pos,{x,2},{y,3}}
22> Point.
{pos,{x,2},{y,3}}
23> c(third).
third.erl:18:1: Warning: function inc_first/1 is unused
%   18| inc_first({A, B}) ->
%     | ^

{ok,third}
24> c(third).
{ok,third}
25> third:inc_first({2, 3}).
{3,3}
26> c(third).
{ok,third}
27> third:inc_first({0, 3}).
{0,3}
BREAK: (a)bort (A)bort with dump (c)ontinue (p)roc info (i)nfo
       (l)oaded (v)ersion (k)ill (D)b-tables (d)istribution
^Cyoussef@joe:~/DDS$ ^C
youssef@joe:~/DDS$ erl
Erlang/OTP 27 [erts-15.0] [source] [64-bit] [smp:8:8] [ds:8:8:10] [async-threads:1] [jit:ns]

Eshell V15.0 (press Ctrl+G to abort, type help(). for help)
1> c(third).
{ok,third}
2> third:inc_first({0, 3}).
{0,3}
3> c(third).
third.erl:20:1: syntax error before: inc_first
%   20| inc_first({A, B}) ->
%     | ^

third.erl:2:2: function inc_first/1 undefined
%    2| -export([zero/1, inc/1, 'inc atom'/1, inc_first/1]).
%     |  ^

error
4> c(third).
{ok,third}
5> third:inc_first({0, 3}).
{0,3}
6> c(third).
{ok,third}
7> third:inc_tuple({0, 3}).
{1,4}
8> third:inc_tuple({0, 3, 1}).
{1,4,2}
9> third:inc_tuple({0, 3, 1, 2}).
** exception error: no function clause matching 
                    third:inc_tuple({0,3,1,2}) (third.erl, line 23)
10> c(third).
{ok,third}
11> third:inc_first2({0, 2}).
{0,2}
12> c(third).
{ok,third}
13> third:inc_first2({0, 2}).
{0,2}
14> h(erlang, element, 2).

  element(N, Tuple)

  Returns the Nth element (numbering from 1) of 
  Tuple.

  For example:

    > element(2, {a, b, c}).
    b
ok
15> h(erlang, size, 1).

  size(Item)

  Returns the number of elements in a tuple or the
  number of bytes in a binary or bitstring.

  For example:

    > size({morni, mulle, bwange}).
    3
    > size(<<11, 22, 33>>).
    3

  For bitstrings, the number of whole bytes is
more (y/n)? (y) n
ok
16> Tuple = {1, 2}.
{1,2}
17> setelement(2,Tuple,40).
{1,40}
18> Tuple.
{1,2}
19> List = [1, 2, 3].
[1,2,3]
20> [1|[2, 3]].
[1,2,3]
21> c(third).
third.erl:2:2: function inc_first2/1 undefined
%    2| -export([zero/1, inc/1, 'inc atom'/1, inc_first/1, inc_tuple/1, inc_first2/1]).
%     |  ^

third.erl:37:1: function inc_list/1 already defined
%   37| inc_list([Head|Tail]) ->
%     | ^

third.erl:35:1: Warning: function inc_list/1 is unused
%   35| inc_list([])->
%     | ^

third.erl:37:1: Warning: function inc_list/1 is unused
%   37| inc_list([Head|Tail]) ->
%     | ^

error
22> c(third).
third.erl:2:2: function inc_first2/1 undefined
%    2| -export([zero/1, inc/1, 'inc atom'/1, inc_first/1, inc_tuple/1, inc_first2/1, inc_list/1]).
%     |  ^

third.erl:37:1: function inc_list/1 already defined
%   37| inc_list([Head|Tail]) ->
%     | ^

error
23> c(third).
third.erl:2:2: function inc_first2/1 undefined
%    2| -export([zero/1, inc/1, 'inc atom'/1, inc_first/1, inc_tuple/1, inc_first2/1, inc_list/1]).
%     |  ^

error
24> c(third).
{ok,third}
25> third:inc_list(List).
[2,3,4]
26> third:inc_list([1,2,3,4,5,6,7]).
[2,3,4,5,6,7,8]
27> List2 = lists:seq(1,10).
[1,2,3,4,5,6,7,8,9,10]
28> third:inc_list(List2).
[2,3,4,5,6,7,8,9,10,11]
29> List3 = lists:seq(1,100).
[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,
 23,24,25,26,27,28,29|...]
30> third:inc_list(List3).
[2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,
 24,25,26,27,28,29,30|...]
31> [1,2].
[1,2]
32> [1|[2]].
[1,2]
33> [1|[2| []]].
[1,2]
34> [1|[2| [] ] ].
[1,2]
35> [1,2] == [1|[2| [] ] ].
true
36> "abc".
"abc"
37> abc.
abc
38> "abc" == [97, 98, 99].
true
39> "abc" == [$a, $b, $c].
true
40> "abc" == [a, b, c].
false
41> [1|apple].
[1|apple]
42> c(third).
{ok,third}
43> third:count([1,2,3]).
3
44> third:count(List2).
10
45> third:count(List3).
100
46> third:count([1|apple]).
1
47> c(third).
third.erl:47:9: ambiguous call of overridden pre Erlang/OTP R14 auto-imported BIF length/1 --
use erlang:length/1 or \"-compile({no_auto_import,[length/1]}).\" to resolve name clash
%   47|     1 + length(Rest);
%     |         ^

error
48> c(third).
third.erl:47:1: Warning: function length/1 is unused
%   47| length([_E, Rest]) ->
%     | ^

{ok,third}
49> c(third).
{ok,third}
50> third:length(List2).
** exception error: no function clause matching 
                    third:length([1,2,3,4,5,6,7,8,9,10]) (third.erl, line 47)
51> third:length([]).
0
52> third:length([1]).
** exception error: no function clause matching 
                    third:length([1]) (third.erl, line 47)
53> c(third).
{ok,third}
54> third:length([1]).
1
55> third:length(List2).
10
56> third:length(List3).
100
57> third:length([1|apple]).
** exception error: no function clause matching 
                    third:length(apple) (third.erl, line 47)
     in function  third:length/1 (third.erl, line 48)
58> PropList=[{1,2}, {2,3}].
[{1,2},{2,3}]
59> c(third).
third.erl:56:13: variable 'Count' is unbound
%   56|     [{Head, Count +1} | inc_proplist (Tail)].
%     |             ^

error
60> c(third).
{ok,third}
61> third:inc_proplist([{3,1}, {4, 5}].
* 1:35: syntax error before: '.'
61> third:inc_proplist([{3,1}, {4, 5}]).
[{3,2},{4,6}]
